admbase/src/Documents/ЗаселениеСотрудников/ЗаселениеСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаселениеСотрудников</name>
  <registerRecords>InformationRegister.ИсторияРазмещенияСотрудников</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Отвественный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресРегистрации</name>
    <type>
      <types>CatalogRef.АдресаРегистрации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаселения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПроживания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДетальныеЗаписи</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Комната</name>
      <type>
        <types>CatalogRef.КомнатыВагоны</types>
      </type>
    </attributes>
    <attributes>
      <name>Место</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

admbase/src/InformationRegisters/ИсторияРазмещенияСотрудников/ИсторияРазмещенияСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияРазмещенияСотрудников</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>АдресРегистрации</name>
    <type>
      <types>CatalogRef.АдресаРегистрации</types>
    </type>
  </resources>
  <resources>
    <name>Комната</name>
    <type>
      <types>CatalogRef.КомнатыВагоны</types>
    </type>
  </resources>
  <resources>
    <name>Место</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьПроживания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаЗаселения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаВыселения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДокументВыселения</name>
    <type>
      <types>DocumentRef.ПеремещениеСотрудников</types>
      <types>DocumentRef.ВыселениеСотрудников</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

admbase/src/InformationRegisters/СведенияОСотрудниках/СведенияОСотрудниках.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СведенияОСотрудниках</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>СрокДействияРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокДействияПатента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДанныеПаспорта</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

admbase/src/Documents/ПеремещениеСотрудников/ПеремещениеСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПеремещениеСотрудников</name>
  <registerRecords>InformationRegister.ИсторияРазмещенияСотрудников</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Отвественный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресРегистрации</name>
    <type>
      <types>CatalogRef.АдресаРегистрации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПроживания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаселения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДетальныеЗаписи</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Комната</name>
      <type>
        <types>CatalogRef.КомнатыВагоны</types>
      </type>
    </attributes>
    <attributes>
      <name>Место</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

admbase/src/Documents/ВыселениеСотрудников/ВыселениеСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыселениеСотрудников</name>
  <registerRecords>InformationRegister.ИсторияРазмещенияСотрудников</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Отвественный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыселения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДетальныеЗаписи</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

admbase/src/Documents/ЗаселениеСотрудников/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	Документы.ПеремещениеСотрудников.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.ВыселениеСотрудников.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
КонецПроцедуры

// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
// Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульСозданиеНаОсновании = ОбщегоНазначения.ОбщийМодуль("СозданиеНаОсновании");
		Возврат МодульСозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(КомандыСозданияНаОсновании, Метаданные.Документы.ЗаселениеСотрудников);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//  КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Перемещение товаров
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Обработка.ПечатьДокументовУчетаСотрудников";
	КомандаПечати.Идентификатор = "ПФ_MXL_КарточкаПроживающего";
	КомандаПечати.Представление = НСтр("ru = 'Карточка проживающего'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеДляПечатнойФормыКарточкаПроживающего(ПараметрыПечати, МассивОбъектов) Экспорт
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
#Область ТекстЗапроса
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИсторияРазмещенияСотрудников.АдресРегистрации,
	|	ИсторияРазмещенияСотрудников.ДатаВыселения,
	|	ИсторияРазмещенияСотрудников.ДатаЗаселения,
	|	ИсторияРазмещенияСотрудников.ДокументВыселения,
	|	ИсторияРазмещенияСотрудников.Комната,
	|	ИсторияРазмещенияСотрудников.Место,
	|	ИсторияРазмещенияСотрудников.НомерСтроки,
	|	ИсторияРазмещенияСотрудников.Период,
	|	ИсторияРазмещенияСотрудников.Регистратор,
	|	ИсторияРазмещенияСотрудников.Сотрудник,
	|	ИсторияРазмещенияСотрудников.СтоимостьПроживания
	|ПОМЕСТИТЬ ИсторияЗаселения
	|ИЗ
	|	РегистрСведений.ИсторияРазмещенияСотрудников КАК ИсторияРазмещенияСотрудников
	|ГДЕ
	|	ИсторияРазмещенияСотрудников.Регистратор В (&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СведенияОСотрудниках.Период,
	|	СведенияОСотрудниках.Сотрудник,
	|	СведенияОСотрудниках.СрокДействияРегистрации,
	|	СведенияОСотрудниках.СрокДействияПатента,
	|	СведенияОСотрудниках.ДанныеПаспорта
	|ПОМЕСТИТЬ СведенияОСотрудниках
	|ИЗ
	|	РегистрСведений.СведенияОСотрудниках КАК СведенияОСотрудниках
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИсторияЗаселения КАК ИсторияЗаселения
	|		ПО СведенияОСотрудниках.Сотрудник = ИсторияЗаселения.Сотрудник
	|		И СведенияОСотрудниках.Период <= ИсторияЗаселения.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(СведенияОСотрудниках.Период) КАК Период,
	|	СведенияОСотрудниках.Сотрудник
	|ПОМЕСТИТЬ ОтборСведения
	|ИЗ
	|	СведенияОСотрудниках КАК СведенияОСотрудниках
	|СГРУППИРОВАТЬ ПО
	|	СведенияОСотрудниках.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОСотрудниках.Период,
	|	СведенияОСотрудниках.Сотрудник,
	|	СведенияОСотрудниках.СрокДействияРегистрации,
	|	СведенияОСотрудниках.СрокДействияПатента,
	|	СведенияОСотрудниках.ДанныеПаспорта
	|ПОМЕСТИТЬ СведенияОСотрудникахИтог
	|ИЗ
	|	СведенияОСотрудниках КАК СведенияОСотрудниках
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборСведения КАК ОтборСведения
	|		ПО СведенияОСотрудниках.Период = ОтборСведения.Период
	|		И СведенияОСотрудниках.Сотрудник = ОтборСведения.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Представление(ИсторияЗаселения.АдресРегистрации) КАК МестоПроживания,
	|	Представление(ИсторияЗаселения.АдресРегистрации.АдресРегистрации) КАК АдресРегистрации,
	|	ИсторияЗаселения.ДатаВыселения,
	|	ИсторияЗаселения.ДатаЗаселения,
	|	ИсторияЗаселения.ДокументВыселения,
	|	ИсторияЗаселения.Комната,
	|	ИсторияЗаселения.Комната.Код КАК НомерКомнаты,
	|	ИсторияЗаселения.Место,
	|	ИсторияЗаселения.НомерСтроки,
	|	ИсторияЗаселения.Период,
	|	ИсторияЗаселения.Регистратор КАК Ссылка,
	|	Представление(ИсторияЗаселения.Сотрудник) КАК ФИОСотрудника,
	|	ИсторияЗаселения.СтоимостьПроживания,
	|	СведенияОСотрудникахИтог.ДанныеПаспорта,
	|	СведенияОСотрудникахИтог.СрокДействияПатента,
	|	СведенияОСотрудникахИтог.СрокДействияРегистрации,
	|	КомнатыВагоны.Код КАК КомнатаКод
	|ИЗ
	|	ИсторияЗаселения КАК ИсторияЗаселения
	|		ЛЕВОЕ СОЕДИНЕНИЕ СведенияОСотрудникахИтог КАК СведенияОСотрудникахИтог
	|		ПО ИсторияЗаселения.Сотрудник = СведенияОСотрудникахИтог.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КомнатыВагоны КАК КомнатыВагоны
	|		ПО ИсторияЗаселения.Комната = КомнатыВагоны.Ссылка";
	
#КонецОбласти
	
	Возврат  Запрос.Выполнить();
	
КонецФункции // ДанныеДляПечатнойФормыКарточкаПроживающего()

#КонецОбласти

#КонецЕсли
